#pragma once
#ifndef _BUTTON_PROCESS_H // Блокируем повторное включение этого модуля
#define _BUTTON_PROCESS_H
//******************************************************************************
// Секция include
//******************************************************************************
#include <math.h>
#include <chrono>

#include "main.h"
#include "USB_procedure.h"
#include "RandomF.h"
#include "MonitorScreenOperation.h"
#include "MouseHook.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************
#define LEFT_CTRL	(1 << 0)
#define LEFT_SHIFT	(1 << 1)
#define LEFT_ALT	(1 << 2)
#define LEFT_GUI	(1 << 3)	
#define RIGHT_CTRL	(1 << 4)
#define RIGHT_SHIFT (1 << 5)
#define RIGHT_tALT	(1 << 6)
#define RIGHT_GUI	(1 << 7)	
//******************************************************************************
// Секция определения типов
//******************************************************************************

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void ButtonProcessStart(void);
void ButtonProcessStop(void);
DWORD StartSetPixelFCondition(UCHAR index);
//******************************************************************************
// Секция определения макросов
//******************************************************************************

#endif
//******************************************************************************
// ENF OF FILE
//******************************************************************************