#pragma once
#ifndef _BUTTON_H // Блокируем повторное включение этого модуля
#define _BUTTON_H
//******************************************************************************
// Секция include
//******************************************************************************
#include <math.h>
#include <chrono>

#include "main.h"
#include "USB_procedure.h"
#include "RandomF.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************
#define LEFT_CTRL	(1 << 0)
#define LEFT_SHIFT	(1 << 1)
#define LEFT_ALT	(1 << 2)
#define LEFT_GUI	(1 << 3)	
#define RIGHT_CTRL	(1 << 4)
#define RIGHT_SHIFT (1 << 5)
#define RIGHT_tALT	(1 << 6)
#define RIGHT_GUI	(1 << 7)	
//******************************************************************************
// Секция определения типов
//******************************************************************************
struct EmulatedKey_DType
{
	BOOL flagEmulated;
	WORD wVk;
	WORD wScan;
	clock_t timeDelay;
	UCHAR ModifiedKey;
};
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
UCHAR KeyIndexFString(UINT index, TCHAR* szResult);
UCHAR SendKey(UINT index, UCHAR flagShift, UCHAR flagAlt, UCHAR flagCtrl);
void StartEKey(void);
void StopEKey(void);
//******************************************************************************
// Секция определения макросов
//******************************************************************************

#endif
//******************************************************************************
// ENF OF FILE
//******************************************************************************