#pragma once
#ifndef _USB_PROCEDURE_H // Блокируем повторное включение этого модуля
#define _USB_PROCEDURE_H
//******************************************************************************
// Секция include
//******************************************************************************
#define _CRT_SECURE_NO_WARNINGS 1

#include <Windows.h>
#include <hidsdi.h>
#include <setupapi.h>
#include <strsafe.h>
#include <wchar.h>

#include "main.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения типов
//******************************************************************************

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
int enumd(void);
int disconhid(void);
void senddata(void);
BOOL GetConectionStatus(void);
BOOL connecthid(TCHAR* Path);
BOOL getinfo(TCHAR* Path);
void USBSendMassage(UCHAR ButtonClick, UCHAR LenButtonClick, UCHAR ModifiedKey);

void StartUSBProcedure();
void StopUSBProcedure();
//******************************************************************************
// Секция определения макросов
//******************************************************************************
#endif
//******************************************************************************
// ENF OF FILE
//******************************************************************************